Repository: sandrokl/PlaylistMerger4Spotify
Catalog: lib/l10n/intl_*.arb
Languages: fr, pt

source: Spotify user
fr: Utilisateur de Spotify
pt: Usuário Spotify

source: OK
fr: D'accord

source: Please login to Spotify
fr: Veuillez vous connecter à Spotify
pt: Faça login no Spotify

source: Welcome
fr: Bienvenue
pt: Bem vindo

# we_will_open_login
source: To begin, we will open the Spotify login page next
fr: Pour débuter, la page de connexion de Spotify s'ouvrira.
pt: Para começar, a seguir vamos abrir a página de login do Spotify.

# makeSureToChooseAPlaylistYouDontDirectlyAdd
source: When asked to choose your DESTINATION PLAYLIST, make sure to choose a playlist that doesn't already contain your music. It will be completely erased and replaced with the new merging results.
fr: Au moment de choisir la PLAYLIST DE DESTINATION, veuillez vous assurer de ne pas choisir une playlist qui contient vos chansons. Celle-ci sera effacée et remplacée avec les résultats de la fusion.
pt: Quando você for escolher sua PLAYLIST DE DESTINO, tenha certeza de não escolher uma playlist que contenha sua música. Ela vai ser apagada e substituída com o resultado da atualização.

# carefulexclamation
source: Careful!
fr: Attention!
pt: Atenção!

# nothingHereForNow
source: Nothing here for now. Start creating your merged playlists using the button below.
fr: Rien ici pour l'instant. Commencez à créer vos playlists fusionnées en utilisant le bouton ci-dessous.
pt: Nada aqui por enquanto. Comece a criar suas playlists combinadas usando o botão abaixo.

source: Confirm
fr: Confirmer
pt: Confirmar

source: DELETE
fr: SUPPRIMER
pt: EXCLUIR

source: cancel
fr: canceller
pt: cancelar

# areYouSureYouWishToDelete_start
source: Are you sure you want to delete
fr: Êtes vous certain de vouloir supprimer la definition de fusion pour
pt: Tem certeza que deseja excluir a definição para

# areYouSureYouWishToDelete_end
source: 's merging definition? This will not delete the playlist in Spotify.
fr: ? Cela ne supprimera pas votre playlist sur Spotify.
pt: ? Isto não irá excluir a playlist no Spotify.

# saving_threedots
source: Saving...
fr: Mise à jour...
pt: Salvando...

source: Open in Spotify
fr: Ouvrir sur Spotify
pt: Abrir no Spotify

# modifyThisMergingRule
source: Modify this merging definition
fr: Modifier la définition de fusion
pt: Modificar a definição

source: -- Select a playlist --
fr: -- Choisir une playlist --
pt: -- Escolha uma playlist --

source: Destination playlist
fr: Playlist de destination
pt: Playlist de destino

source: Source playlists
fr: Playlists d'origine
pt: Playlists de origem

source: DISMISS
fr: FERMER
pt: FECHAR

source: Do not show again
fr: Ne plus afficher
pt: Não exibir novamente

# changesSaved
source: Changes saved. You can run the merging again to update it in Spotify.
fr: Changements sauvegardés. Vous pouvez éxécuter la mise à jour à nouveau pour rafraîchir la playlist sur Spotify.
pt: Alterações salvas. Você pode executar uma nova atualização no Spotify.

# deleteThisMergingRule
source: Delete this merging definition
fr: Supprimer cette definition
pt: Excluir esta definição

source: CREATE IT
fr: CRÉER
pt: CRIAR

# nameOfThePlaylist
source: New playlist's name
fr: Nom de la nouvelle playlist
pt: Nome da nova playlist

source: Create new playlist
fr: Créer une nouvelle playlist
pt: Criar nova playlist

source: Please enter the playlist name
fr: Veuillez rentrer le nom de la playlist
pt: Digite o nome da nova playlist

source: Playlist created with PlaylistMerger 4 Spotify
fr: Playlist créée avec PlaylistMerger 4 Spotify
pt: Playlist criada usando PlaylistMerger 4 Spotify

source: Import merging definitions
fr: Importer les définitions
pt: Importar definições

source: Export merging definitions
fr: Exporter les définitions
pt: Exportar definições

# settings3dots
source: Settings...
fr: Réglages...
pt: Opções...

source: Settings
fr: Réglages
pt: Opções

source: Update this in Spotify
fr: Mettre à jour sur Spotify
pt: Atualizar no Spotify

# mergingDefinitionsImportedSuccessfully
source: Merging definitions imported successfully. Playlists absent from your current library have not been imported.
fr: Définition des fusions importée avec succès. Les playlists absentes de votre bibliothèque actuelle n'ont pas été importées.
pt: As definições de combinação foram importadas com sucesso. As playlists ausentes de sua biblioteca atual não foram importadas.

# anUpdateToYourPlaylistIsBeingMadeInSpotify
source: {howMany, plural, one {An update to your playlist is being made in Spotify. We'll let you know when it's finished.} other {An update to your playlists is being made in Spotify. We'll let you know when it's finished.}}
fr: {howMany, plural, one {La mise à jour de votre playlist est lancée sur Spotify. On vous avisera quand ce sera terminé.} other {Les mises à jour de vos playlists sont lancées sur Spotify. On vous avisera quand ce sera terminé.}}
pt: {howMany, plural, one {Uma atualização de playlist está em progresso. Avisaremos quando tudo estiver pronto.} other {As atualizações de suas playlists estão em progresso. Avisaremos quando tudo estiver pronto.}}

# notificationSuccessTitle
source: <b>Success!</b>
fr: <b>Succès!</b>
pt: <b>Sucesso!</b>

# notificationFailureTitle
source: <b>Failure</b>
fr: <b>Échec</b>
pt: <b>Erro</b>

# notificationPlaylistUpdatedSuccessfully
source: &#128516 Your merged playlist <em>{name}</em> has been updated successfully.
fr: &#128516 Votre playlist fusionée <em>{name}</em> a été mise à jour.
pt: &#128516 Sua playlist combinada <em>{name}</em> foi atualizada com sucesso.

# notificationAllPlaylistsUpdatedSuccessfully
source: &#128516 All your merged playlists have been updated successfully.
fr: &#128516 Toutes vos playlists ont bien été mises à jour.
pt: &#128516 Todas as playlists combinadas foram atualizadas com sucesso.

# notificationMergingFailed
source: &#128577 There was an error trying to update your playlists. Please try again later.
fr: &#128577 Une erreur s'est passée pendant la mise à jour des playlists. Veuillez le réssayer à nouveau.
pt: &#128577 Erro ao tentar atualizar suas playlists. Por favor tente novamente mais tarde.

# channelNameMergingResults
source: Results of the playlists updates requests
fr: Résultat des mises à jour des playlists
pt: Resultados dos updates de playlists

# notificationInProgressChannelName
source: Update in progress
fr: Mise à jour en progrès
pt: Atualização em progresso

# notificationInProgressMessage
source: Updating playlist...
fr: Mise à jour de playlist...
pt: Atualizando playlist...

# settingsAutomaticUpdates
source: Automatic updates
fr: Mises à jour automatiques
pt: Atualizações automáticas

# settingsAutomaticUpdatesDescription
source: Whether or not the app should update your playlists overnight (experimental)
fr: Activer la mise à jour quotidienne automatique de vos playlists (expérimental)
pt: Escolher se o app deve atualizar as playlists diariamente (experimental)

# settingsApplicationTheme
source: Application theme
fr: Thème de l'appli
pt: Tema do app

# settingsUseSystemTheme
source: System theme
fr: Thème du systeme
pt: Tema do aparelho

# settingsUseLightTheme
source: Light theme
fr: Thème clair
pt: Tema claro

# settingsUseDarkTheme
source: Dark theme
fr: Thème sombre
pt: Tema escuro

# settingsLanguage
source: Language
fr: Langue
pt: Idioma

# settingsLanguageAutomatic
source: Automatic
fr: Automatique
pt: Automático

# settingsMergingHistory
source: Merging history
fr: Historique des mises à jour des playlists
pt: Histórico de atualizações de playlists

# settingsIfYouWantToContact
source: If you want to report a bug, make a suggestion, help translate this app into your language, or simply talk about your experience, please contact the developer by email.
fr: Si vous voulez rapporter un bogue, faire une suggestion, ou tout simplement partager votre expérience, veuillez contacter le développeur par courriel.
pt: Se você quiser avisar de um bug, fazer uma sugestão, ou simplesmente falar da sua experiência, por favor contatar o desenvolvedor por email.

# historyRecentUpdates
source: Recent updates
fr: Mises à jour récentes
pt: Atualizações recentes

# historyViewAllPlaylistsHistory
source: -- View all playlists history --
fr: -- Voir toutes les playlists --
pt: -- Histórico de tudo --

# historyResult
source: Result:
fr: Résultat:
pt: Resultado:

# historySuccess
source: Success
fr: Succès
pt: Sucesso

# historyFail
source: Fail
fr: Échec
pt: Falha

# historyPromptedBy
source: Prompted by: {who}
fr: Initié par: {who}
pt: Iniciado por: {who}

# historyYou
source: You
fr: Vous-même
pt: Você

# historyAutomaticUpdate
source: Automatic Update
fr: Mise à Jour Automatique
pt: Atualização Automática

# historyNA
source: N/A
fr: S/O

# historyTracksAddedRemoved
source: Tracks Added: {added} - Removed: {removed}
fr: Chansons ajoutées: {added} - Retirées: {removed}
pt: Faixas adicionadas: {added} - Removidas: {removed}

# settingsSupport
source: Support
pt: Suporte

# playlistIgnoreList
source: Ignore list
pt: Lista à ignorar
